{
  "backend/main.mo": "Main Motoko actor for a multi-vendor jewellery/clothes rental platform, defining user, product, rental, and audit log types with role-based access control, blob storage mixins, and CRUD operations for users, products, and audit logs.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (home page layout, header/nav redesign, hero section, etc.) to their source files, component dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key functionality of every component, page, and utility in the frontend.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar) used throughout the UI.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'Multi-Vendor Jewellery & Clothes Rental Platform' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React application file that defines all TanStack Router routes for public, customer, vendor, center, and admin pages, wrapping them in role-protected layouts with a shared header, footer, and toast notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button component that handles authentication state, shows a loading spinner during login, and clears the React Query cache on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A multi-step modal dialog for new users to complete profile setup by selecting a role (customer, vendor, or center) and submitting relevant registration details like name, email, phone, GST number, and KYC documents.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated users to the home page and optionally enforces role-based access, showing a loading spinner while auth state is being fetched.",
  "frontend/src/components/dashboard/ChartWrapper.tsx": "A reusable chart component that renders line, bar, or pie charts using Recharts based on the provided type and data props, wrapped in a responsive container with an optional title.",
  "frontend/src/components/dashboard/DashboardLayout.tsx": "The main dashboard shell providing a responsive sidebar with role-based navigation, user info, a top bar with notification popover, and a mobile drawer, wrapping page-specific content via children.",
  "frontend/src/components/dashboard/DataTable.tsx": "A generic, reusable data table component with built-in search filtering, status filtering, pagination, and CSV export functionality, rendering typed columns with optional sort and accessor support.",
  "frontend/src/components/dashboard/MetricCard.tsx": "A styled card component for displaying a single KPI metric with an optional icon, subtitle, and trend indicator (up/down/neutral) with configurable accent color.",
  "frontend/src/components/dashboard/NotificationPanel.tsx": "A notification panel that displays a scrollable list of app notifications from the order store, with type-based icons/colors, unread highlighting, and a mark-all-read action.",
  "frontend/src/components/dashboard/RoleNavigation.tsx": "Renders a role-based sidebar navigation component that maps each UserRole (customer, vendor, center, admin) to a list of nav items with icons, highlighting the active route.",
  "frontend/src/components/home/CategorySection.tsx": "Displays a grid of four featured product categories (e.g., Bridal Jewellery, Wedding Lehenga) with images, tags, and scroll-triggered animations, navigating to the products page on click.",
  "frontend/src/components/home/CountdownTimer.tsx": "Shows a live countdown timer initialized ~23h 47m 33s in the future, updating every second and displaying hours, minutes, and seconds in styled blocks.",
  "frontend/src/components/home/FeaturedVendorsSection.tsx": "Renders a static grid of four featured vendor cards showing name, specialty, rating, product count, and a verified badge, linking to the products page.",
  "frontend/src/components/home/HeroSection.tsx": "Full-screen hero section with scroll-triggered animations, a headline, subheading, CountdownTimer, CTA buttons navigating to products, and trust indicator badges.",
  "frontend/src/components/home/HowItWorksSection.tsx": "Displays a 4-step process section (vendor dispatch → trial booking → payment → delivery) with icons, numbered badges, a desktop connector line, and scroll-triggered animations.",
  "frontend/src/components/home/NearestCentersSection.tsx": "Displays a grid of four demo LuxeRent physical store locations with address, rating, product count, available slots, and timing, using IntersectionObserver for scroll-triggered animations.",
  "frontend/src/components/home/RecentlyBookedToast.tsx": "Shows a dismissible toast notification after 5 seconds featuring a randomly selected demo booking (name, product, center, time), then auto-hides after another 5 seconds.",
  "frontend/src/components/home/SanitizationGuaranteeBadge.tsx": "Renders a full-width section on a dark emerald background highlighting LuxeRent's sanitization process with a badge image and three process steps (chemical cleaned, UV sterilized, QC verified).",
  "frontend/src/components/home/SearchBar.tsx": "Empty file with no content.",
  "frontend/src/components/home/StickyBookTrialButton.tsx": "A mobile-only fixed bottom CTA button that navigates to the /products route when tapped, styled with a gold gradient.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Auto-advancing carousel of five customer testimonials with manual prev/next controls, dot navigation, and scroll-triggered animations, cycling every 4.5 seconds.",
  "frontend/src/components/home/TrendingProductsSection.tsx": "Displays a responsive grid of six demo rental products with image, pricing, deposit, center location, sanitization date, rating, and a 'Most Booked' badge, with scroll-triggered staggered animations.",
  "frontend/src/components/home/TrustStripSection.tsx": "Renders a horizontal strip of four trust-signal cards (sanitization, deposit protection, physical trial, safe payments) with icons and scroll-triggered animations.",
  "frontend/src/components/home/VendorPromotionSection.tsx": "A home page section promoting the vendor partnership program, displaying three benefit cards (commission, inventory, payouts) with scroll-triggered animations and a CTA button to navigate to vendor registration.",
  "frontend/src/components/home/WhatsAppFAB.tsx": "A fixed floating action button that opens a WhatsApp chat with a pre-filled booking message when clicked.",
  "frontend/src/components/layout/Footer.tsx": "Site-wide footer component rendering brand info, social media links, and three navigation link columns (Collections, For Business, Legal) along with contact details and a copyright notice.",
  "frontend/src/components/layout/Header.tsx": "Fixed site header with a top utility bar (location selector, phone), main nav links, search/filter panel, and Internet Identity-based auth controls including role-based dashboard routing.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Custom hook that combines Internet Identity state with the caller's user profile to expose authentication status, current role, loading state, and whether profile setup is needed.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile CRUD, customer/vendor/center registration mutations, and product fetch/upload/update/delete operations.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, defines CSS custom properties for a luxury color palette (gold, burgundy, ivory), and provides utility classes for gradients, shadows, and scroll animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AccessDenied.tsx": "A 403-style page that displays an access denied message and provides navigation buttons to go home or to the user's role-specific dashboard.",
  "frontend/src/pages/admin/Analytics.tsx": "Admin analytics dashboard showing KPI metric cards and charts for revenue, rentals, trials, and conversion rates, plus a center performance leaderboard with a period selector.",
  "frontend/src/pages/admin/CenterApproval.tsx": "Admin page that lists all registered centers fetched from the backend and allows approving or rejecting their KYC status via mutation hooks.",
  "frontend/src/pages/admin/CommissionSettings.tsx": "Admin form for configuring platform commission percentages (admin fee and center share), with a live formula preview showing the vendor net percentage and a mock change history log.",
  "frontend/src/pages/admin/Dashboard.tsx": "Admin dashboard page displaying platform metrics (revenue, users, pending approvals, products) with a revenue/rentals line chart and a pending approvals summary linking to vendor, center, and product management pages.",
  "frontend/src/pages/admin/DisputeManagement.tsx": "Admin page for viewing and managing customer disputes, allowing admins to resolve or escalate open disputes with resolution notes via a dialog, using seeded demo data if no disputes exist in the store.",
  "frontend/src/pages/admin/GSTReport.tsx": "Admin page for generating and exporting GST reports filtered by date range, displaying transaction-level GST data in a table with a total GST summary and CSV export capability.",
  "frontend/src/pages/admin/PayoutRelease.tsx": "Admin page for reviewing and releasing pending vendor payouts, showing gross, commission, center share, and net amounts per payout with a one-click release action and status badges.",
  "frontend/src/pages/admin/PlatformRevenue.tsx": "Admin page showing platform revenue analytics with metric cards for total revenue, admin commission, center payouts, and vendor payouts, plus line and bar charts for revenue trends and distribution.",
  "frontend/src/pages/admin/ProductApproval.tsx": "Admin page listing unapproved vendor products with images, pricing details, and an approve button that calls the backend approval mutation and shows toast feedback.",
  "frontend/src/pages/admin/VendorApproval.tsx": "Admin page that lists all vendor users and allows approving their KYC status via a mutation, displaying pending/approved badges and a reject placeholder.",
  "frontend/src/pages/center/Dashboard.tsx": "Center dashboard page showing metric cards for inventory statuses (at center, on trial, rented, sanitizing), an inventory overview list, notifications panel, and quick action buttons.",
  "frontend/src/pages/center/HandoverConfirmation.tsx": "Center page listing orders in 'readyForHandover' status, requiring a customer verification ID input before confirming handover and transitioning the order to 'rented'.",
  "frontend/src/pages/center/InventoryReceipt.tsx": "Center page displaying inbound products at the center awaiting acknowledgment, allowing staff to confirm receipt via the useAcknowledgeReceivingProduct mutation.",
  "frontend/src/pages/center/POSBooking.tsx": "Center POS page for booking walk-in customer trials by selecting a product and entering customer details and a trial date/time, storing the booking in the order store.",
  "frontend/src/pages/center/QCVerification.tsx": "Center page listing products pending QC inspection, allowing staff to approve or reject each product via a confirmation dialog with optional notes.",
  "frontend/src/pages/center/ReturnQC.tsx": "A center-side page for inspecting returned rental orders, allowing staff to select an order, assess product condition, apply damage charges, and update the order status to 'returned' via the order store.",
  "frontend/src/pages/center/SanitizationWorkflow.tsx": "A center-side page for logging product sanitization records with details like cleaning type, chemicals used, staff name, and before/after images, generating a sanitization tag on approval.",
  "frontend/src/pages/center/TrialSlotManagement.tsx": "A center-side page that lists all trial bookings from the order store and allows staff to mark confirmed trials as completed or cancelled.",
  "frontend/src/pages/customer/Dashboard.tsx": "The customer dashboard displaying metric cards for active rentals, upcoming trials, wallet balance, and deposit held, along with a recent orders list and a rental trend chart.",
  "frontend/src/pages/customer/DisputeForm.tsx": "A customer-facing form for raising disputes against orders, capturing the order, reason, and description, then submitting the dispute to the order store with a success confirmation screen.",
  "frontend/src/pages/customer/OrderTracking.tsx": "A customer-facing page that displays all orders with a visual step-by-step status progress tracker showing completed, current, and pending stages of the rental lifecycle.",
  "frontend/src/pages/customer/ProductBrowse.tsx": "Customer-facing page for browsing approved products with search, status filter, and price range filters, displaying results in a responsive grid with loading skeletons.",
  "frontend/src/pages/customer/ProductDetail.tsx": "Customer-facing product detail page showing images, product info, and a 'Book Trial' button that adds a trial booking to the order store if the user is authenticated.",
  "frontend/src/pages/customer/RentalHistory.tsx": "Customer dashboard page displaying all past and active rental orders in a searchable, filterable DataTable with CSV export support.",
  "frontend/src/pages/customer/Wallet.tsx": "Customer wallet page showing wallet balance and security deposit held as metric cards, plus a mock transaction history list with credit/debit indicators.",
  "frontend/src/pages/Home.tsx": "The main landing page that composes all homepage sections (hero, categories, trending products, centers, testimonials, etc.) and injects SEO meta tags and JSON-LD structured data.",
  "frontend/src/pages/vendor/Dashboard.tsx": "Vendor dashboard showing product count, active rentals, center inventory, and monthly revenue metrics alongside a bar chart and quick-action buttons.",
  "frontend/src/pages/vendor/EarningsSummary.tsx": "Vendor earnings page that calculates and displays gross revenue, admin commission (15%), center share (10%), and net payout (75%) with a monthly bar chart breakdown.",
  "frontend/src/pages/vendor/InventoryManagement.tsx": "Vendor page that lists all their products with status badges and allows sending a product to a distribution center via a dialog prompt.",
  "frontend/src/pages/vendor/OrdersList.tsx": "Vendor page that displays all rental orders involving the vendor's products in a searchable, filterable DataTable with CSV export.",
  "frontend/src/pages/vendor/PayoutHistory.tsx": "Vendor page showing payout history with gross, commission, center share, and net amounts using mock data in a filterable DataTable.",
  "frontend/src/pages/vendor/ProductUpload.tsx": "Vendor form page for uploading a new product with name, description, pricing, and up to 5 images, showing upload progress and a success state.",
  "frontend/src/store/orderStore.ts": "Zustand store defining types and state for orders, trial bookings, sanitization records, disputes, notifications, and wallet balance, seeded with demo data.",
  "frontend/src/utils/csvExport.ts": "Utility function that converts an array of typed data rows into a CSV file and triggers a browser download.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency (INR), dates, and mapping order/product status keys to display colors and human-readable labels.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and cleaning URL parameters from both query strings and hash-based routes. Supports sessionStorage fallback for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a luxury design system with custom colors (Royal Gold, Burgundy, Ivory White), Playfair Display/Poppins fonts, extended border radii, gold glow shadows, and animation utilities.",
  "project_state.json": "Project state snapshot describing a multi-vendor jewellery and clothes rental platform with a 4-role workflow (Customer, Vendor, Center, Admin), tech stack details, design system tokens, required image assets, and a list of existing implemented features."
}